[
  {
    "path": "posts/2021-06-20-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "To makeover the interactive data visualisation provided of Singapore’s merchandise trade from 2011 to 2020.",
    "author": [
      {
        "name": "Nurulasyiqah Md. Taha",
        "url": "https://www.linkedin.com/in/nurulasyiqah-md-taha/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n1 Critic\r\nWe will critic the following data visualisation based on clarity and aesthetic.\r\n Source: Department of Statistics, Singapore\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n2 Alternative data visualisation\r\nWe propose an alternative data visualisation to strengthen the visualisation in terms of clarity and aesthetics.\r\n2.1 Sketch\r\nA brief sketch of the proposed alternative data visualisation is as follows:\r\n2.2 Advantages of alternative data visualisation\r\n2.3 Proposed data visualisation (in Tableau)\r\nUsing Tableau 2021.1, the alternative data visualisation is available for viewing in Tableau Public. A snapshot of the dashboard is as follows:\r\n3 Step-by-step guide to prepare data visualisation\r\nDownload the dataset from the Department of Statistics Singapore’s website on Merchandise Trade. Expand the “Merchandise Trade by Region/Market” tab and click on “Download all in Excel”. Retain the file name as “outputFile.xlsx”.\r\n3.1 Data preparation in Tableau Prep\r\nOpen Tableau Prep Builder 2021.1 and click on “Connect” -> To a File: Microsoft Excel.\r\n3.2 Creating bubble plots in Tableau\r\nOpen Tableau. Click and drag “__________” into the workspace.\r\n3.3 Creating dashboard in Tableau\r\nClick on “New dashboard” tab. Click and drag the “Export” and “Import” sheets into the dashboard. Realign the items on the dashboard so that everything is clear. Select “Automatic” as the size.\r\n4 Three major observations\r\n4.1\r\n4.2\r\n4.3\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T13:07:33+08:00",
    "input_file": "dataviz-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-05-30-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "To makeover the data visualisation provided of Singapore's merchandise trade from 2019 to 2020.",
    "author": [
      {
        "name": "Nurulasyiqah Md. Taha",
        "url": "https://www.linkedin.com/in/nurulasyiqah-md-taha/"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n1 Critic\r\nWe will critic the following data visualisation based on clarity and aesthetic.\r\n\r\n1.1 Clarity\r\nThe data visualisation mentions “top six trading countries” without defining what it means – it could refer to either countries Singapore exports the most to, imports the most from, or with the largest net value of export and import.\r\nThe order of the graphs in 2 rows of 3 provides no information on the rank of each trading country.\r\nThe overlapping shaded areas under the line graphs makes it difficult to read the values of import and export for each country.\r\nThe x-axis on the graph for Japan is incorrect because it only shows one period of 2020.\r\n“Month of period” for the x-axis sounds awkward. Each tick on the x-axis could simply indicate the “Month Year”.\r\n1.2 Aesthetic\r\nThe grid lines on the y-axis are too light and it is therefore difficult to read the exact import and export values.\r\nThe absence of ticks on the x-axis of time makes reading the graphs difficult. The ticks should be in the middle of the period (month).\r\nThe width for x-axis (months) are not standardised across all six graphs. Since some graphs are wider than the rest, it is difficult to compare trends or patterns across countries.\r\nThe dual y-axis for values of exports and imports makes it difficult to determine the exact import and export values. For example, when you look at the Dec 2020 value of export to the US, the line of vision to trace back to the relevant y-axis on the left is challenging.\r\n2 Alternative data visualisation\r\nWe propose an alternative data visualisation to strengthen the visualisation in terms of clarity and aesthetics.\r\n2.1 Sketch\r\nA brief sketch of the proposed alternative data visualisation is as follows:\r\n\r\n2.2 Advantages of alternative data visualisation\r\nIt would be more meaningful to look at merchandise exports and imports separately because how much Singapore exports to or imports from a specific country/region depends on different export and import policies.\r\nFor merchandise exports, we will plot a line graph for the export values of six countries that Singapore exports merchandise to the most between 2019 to 2020. A single y-axis for the export value makes it easier to compare Singapore’s export trends across the six countries during the two year period.\r\nFor merchandise imports, we will adopt a similar method as merchandise exports.\r\nThe proposed visualisation clearly distinguishes the top six countries/regions that Singapore exports from the top six countries/regions that Singapore imports from.\r\nThe dot points for each month makes it easier to read the import and export values. Also, the legend is arranged in the same order as the rank of the countries/regions as at Dec 2020 for ease of reading.\r\n2.3 Proposed data visualisation (in Tableau)\r\nUsing Tableau 2021.1, the alternative data visualisation is available for viewing in Tableau Public. A snapshot of the dashboard is as follows:\r\n\r\n3 Guide to prepare data visualisation\r\nDownload the dataset from the Department of Statistics Singapore’s website on Merchandise Trade. Expand the “Merchandise Trade by Region/Market” tab and click on “Download all in Excel”. Retain the file name as “outputFile.xlsx”.\r\n3.1 Data preparation in Tableau Prep\r\nOpen Tableau Prep Builder 2021.1 and click on “Connect” -> To a File: Microsoft Excel.\r\n\r\nCheck the “Use Data Interpreter” box to perform preliminary cleaning on the dataset.\r\n\r\nClick and drag “T1” table into the workspace. Right click and rename it to “Imports”.\r\n\r\nClick on the “+” sign beside “Imports” and select “Add clean”.\r\n\r\nRemove all “Fields” before 2019 Jan and after 2020 Dec.\r\n\r\nTo extract the country/region name, click on the “drop-down” arrow of the “Variables” field -> Split Values -> Automatic.\r\n\r\nTableau Prep will split the “Variables” field into two. Under the “Variables - Split 2” field, right click on “Million” and select “Exclude” as these refer to aggregate values at the regional level. Under the “Variables - Split 1” field, right click on “Total Merchandise Imports” as we do not require this aggregate information for our data visualisation.\r\n\r\nDouble-click on “Variables - Split 1” field to rename it to “Country”. Right-click on “Variables - Split 2” and “Variables” fields to remove them as they are redundant.\r\n\r\nClick on the ‘+’ sign beside “Clean 1” and select “Output” to save the output as a “import.csv” file.\r\n\r\nPerform the above steps for table “T2” and save the output as a “export.csv” file.\r\n3.2 Data preparation in Microsoft Excel\r\nIn Microsoft Excel, open “export.csv” and create a “Total export value 2019-2020” column to aggregate the value for each country/region. Click “Sort” to sort this column in descending order to obtain the top six countries that Singapore exports to.\r\n\r\nOpen “import.csv” and perform the same steps as above to obtain the top six countries that Singapore imports from.\r\n\r\nTranspose the above information into “Month”, “Trade”, “Country/Region” and “Value” and save as “top6traders.xlsx” file.\r\n\r\n3.3 Creating line graphs in Tableau\r\nOpen Tableau. Click and drag “top6traders.xlsx” into the workspace.\r\n\r\nClick and drag the “Trade” and “Month” pills into Columns and “Value” pill into Rows to get the following basic chart.\r\n\r\nClick on the “Trade” pill under Columns and select “Filter”. Check only the “Export” box.\r\n\r\nRename the chart title as follows:\r\n\r\nClick on the “drop-down” arrow in the Legend box and select “Sort” -> Manual. Sort the countries according to the relative rank as at Dec 2020.\r\n\r\nDouble-click on the x-axis and edit the “Title” field to be empty to remove the redundant “Month by Month” header.\r\n\r\nDouble-click on the y-axis and rename the “Title” to “Value (S$)”.\r\n\r\nRename the worksheet tab to “Export”. The final line graph for top six export partners looks as follows:\r\n\r\nRight-click on the “Export” sheet to duplicate it and rename the duplicate to “Import”. Under the Filter panel, change the filter to “Import”.\r\n\r\nPerform the same steps as above to rename the title and sort the Legend. The final line graph for top six export partners looks as follows:\r\n\r\n3.4 Creating dashboard in Tableau\r\nClick on “New dashboard” tab. Click and drag the “Export” and “Import” sheets into the dashboard. Realign the items on the dashboard so that everything is clear. Select “Automatic” as the size.\r\n\r\nThe final dashboard looks as follows:\r\n\r\n4 Three major observations\r\nBased on the alternative data visualisation, we made the following observations:\r\n4.1 Mainland China is Singapore’s top export and import partner\r\nThroughout 2019 and 2020, Singapore exported the most to Mainland China. Between Jan to Apr 2020, Singapore exported only slightly more to Hong Kong than Mainland China.\r\nDuring this two year period, Singapore also imported the most from Mainland China. When imports from Mainland China declined from Apr to June 2020, it appears that Singapore supplemented this with increased imports from Malaysia and Taiwan.\r\n4.2 A general dip in both exports and import between Mar to May 2020\r\nThe COVID-19 pandemic impacted both Singapore’s outward and inward trades with all its major partners during the period of border closure.\r\n4.3 Trade with Malaysia most sensitive between Jan to May 2020\r\nAs Singapore’s closest trading partner, we observe that both exports to and imports from Malaysia greatly suffered when our borders closed due to the COVID-19 pandemic.\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T23:43:30+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to 'Visual Analytics by Syiqah'",
    "description": "Welcome to my blog! In this blog, I will share data visualisation makeovers, assignments and academic projects related to data analytics and visual analytics.",
    "author": [
      {
        "name": "Nurulasyiqah Md. Taha",
        "url": "https://www.linkedin.com/in/nurulasyiqah-md-taha/"
      }
    ],
    "date": "2021-05-28",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T20:41:25+08:00",
    "input_file": {}
  }
]
